package com.andrukhiv.mynavigationdrawer;

import android.arch.lifecycle.ViewModel;

public class GrapesModel extends ViewModel{

    private String name;
    private String description;
    private String web;
    private int imageId;

    // Конструктор
        private GrapesModel(String name, int imageId, String description, String web) {
        this.name = name;
        this.imageId = imageId;
        this.description = description;
        this.web = web;
    }

    // grapes - масив з 10 об'єктів GrapesModel
    public static final GrapesModel[] grapes = {
            new GrapesModel("Августін", R.drawable.avgustin, "Августін - " +
                    "столовий сорт винограду з підвищеною стійкістю до хвороб і морозу. Дозріває в" +
                    " середині серпня і за зовнішнім виглядом грон і ягід нагадує сорт Плевен. Грона" +
                    " конічні, середньої щільності (вага 400-500 г). Ягода розміром 2,7 x 1,8 см. " +
                    "Важить до п’яти грамів, простого, але гармонійного смаку, біла, на сонці злегка " +
                    "просвічується, що надає гроздям особливу ошатність. Сорт винограду має високі " +
                    "якісні характеристики, невибагливість, надійність і велику врожайність " +
                    "(120-140 ц / га).", "http://vinograd.info/sorta/stolovye/avgystin.html"),
            new GrapesModel("Агат донський", R.drawable.agat_donskoy, "Агат донський - сильнорослий, " +
                    "столовий сорт винограду з підвищеною стійкістю " +
                    "до хвороб і морозу. Грона Агата донського великі, конічні, помірно-щільні, " +
                    "іноді пухкі, середньою вагою 400-600 г. Ягоди великі, 22-24 мм, 4-5 г, округлі, " +
                    "темно-сині, простого смаку. Шкірочка ягід щільна, але не груба, м’якоть " +
                    "м’ясиста. Дегустаційна оцінка свіжого винограду 7,7 бала (контрольний сорт " +
                    "Шасла біла - 7,3 бала). Квітки у сорту Агат донський двостатеві. Пагони " +
                    "визрівають дуже добре. Плодоносних пагонів 75-80 відсотків, число грон на " +
                    "пагон 1,3-1,5. При гарному догляді часто на пагонах винограду по три суцвіття. " +
                    "Врожайність висока і стабільна.", "http://vinograd.info/sorta/stolovye/agat-donskoi.html"),
            new GrapesModel("Аладдін", R.drawable.aladdin, "Аладдін, нова столова " +
                    "гібридна форма винограду. Термін дозрівання дуже ранній або ранній, в умовах  " +
                    "Новочеркаська дозріває на початку серпня. Кондиції на 10 серпня 2006: " +
                    "цукристість 18,8 г / 100 см3, кислотність 7,0 г / дм3. Квітка двостатева. " +
                    "Результати перезимівлі в укривній культурі взиму 2006: розпустилися бруньки   " +
                    "79,5 відсотків, з них плодоносних пагонів 65 відсотків, коефіцієнт плодоношення " +
                    "1,1. Кущі середньої сили росту.", "http://vinograd.info/sorta/stolovye/aladdin.html"),
            new GrapesModel("Аліготе", R.drawable.aligote, "Аліготе (Aligote) - " +
                    "французький винний сорт винограду народної селекції. Він відноситься до " +
                    "еколого-географічної группи західно-європейських сортів винограду.",
                    "http://vinograd.info/sorta/vinnye/aligote.html"),
            new GrapesModel("Аметист новочеркаський", R.drawable.ametisy_novocherkaskiy, "Аметист " +
                    "новочеркаський, нова столова гібридна форма " +
                    "винограду. Термін дозрівання дуже ранній, в умовах Новочеркаська дозріває в " +
                    "кінці липня - початку серпня. Кондиції на 4 серпня 2006: цукристість 15,3 г / " +
                    "100 см3, кислотність 5,7 г / дм3. Квітка двостатева. Результати перезимівлі в " +
                    "укривній культурі взимку 2006: розпустилися бруньок 79,5 відсотків, з них " +
                    "плодоносних пагонів 73,9 відсотків, коефіцієнт плодоношення 1,2. Кущі вище " +
                    "середньої сили росту. Грона середньої щільності, середня маса грона 572 г, " +
                    "середня маса ягоди 6,2 г, ягоди подовжені, темно-рожеві. М’якоть " +
                    "м’ясисто-соковита, шкірка тонка. Смак гармонійний, нагадує смак сливи Ренклод " +
                    "Альтана. Транспортабельність висока. Дегустаційна оцінка свіжого винограду 8,1 " +
                    "бала. Дуже врожайний, вимагає нормування суцвіттями. Стійкість до хвороб і " +
                    "морозостійкість форми винограду Аметист новочеркаський вивчається.",
                    "http://vinograd.info/sorta/stolovye/ametist-novocherkasskii.html"),
            new GrapesModel("Ананасовий", R.drawable.ananasny, "Ананасовий - " +
                    "універсальний сорт винограду. Отримано в Америці шляхом міжвидової гібридизації " +
                    "Вітіс вініфера і Вітіс Лабруска. Листя великі, красиві, сірувато-зеленого " +
                    "забарвлення, майже цільні, поверхня пухирчаста, знизу густо опушені, зверху " +
                    "майже без опушення. Пластинка листка вигнута у вигляді воронки. Черешкова виїмка " +
                    "зазвичай відкрита, стрільчата. Квітка двостатева. У сорту винограду Ананасовий " +
                    "в порівнянні з іншими ізабельних сортами досить велике гроно (до 300 г), велика " +
                    "овальна жовто-зелена ягода (3,8-4,6 г). М’якоть слизиста, шкірка товста, погано " +
                    "з’їдаєма.", "http://vinograd.info/sorta/yniversalnye/ananasnyi.html"),
            new GrapesModel("Андрос", R.drawable.ananasny, "Андрос - підщепних " +
                    "сорт винограду. Знаходиться в Державному реєстрі селекційних досягнень Росії, " +
                    "допущених до використання, з 2000 року. Сформувався лист середнього розміру, " +
                    "темно-зелений, тонкий, голий, слабо розсічений. Три лопаті намічаються за " +
                    "рахунок довгих верхніх зубців. Поверхня листа зморшкувата. Черешковая виїмка " +
                    "широко відкрита у вигляді вхідного кута. Квітка чоловічого типу. Кущі сильнорослі." +
                    "", "http://vinograd.info/sorta/ostalnoe/andros.html"),
            new GrapesModel(
                    "Антрацит",
                    R.drawable.charly, "Антрацит - столова " +
                    "гібридна форма винограду, дуже раннього терміну дозрівання. Дозріває в першій " +
                    "половині серпня. Квітка двостатеві. Середньоросла. Гроно велика і дуже велика " +
                    "600 -800г, без горошенія. Ягоди великі 6-7 г, овальні, чорного кольору. М'якоть " +
                    "щільна. Смак приємний, гармонійний. Пагони визрівають рано по всій довжині. " +
                    "Укорінення живців хороше. Стійкість до грибних хвороб і морозу вивчається." +
                    "", "http://vinograd.info/sorta/stolovye/charli.html"),
            new GrapesModel(
                    "Аркадія", R.drawable.arkadiya,
                    "Аркадія - столовий " +
                    "сорт винограду. Ця солодка батьківська парочка, де Молдова - в першу чергу, " +
                    "носій генів стійкості, а Кардинал - відповідав за якість, дала чимало непоганих " +
                    "сортів і форм винограду, і Аркадія, напевно, кращий. Сорт відноситься до дуже " +
                    "ранніх (115-125 днів). Середньо- або сильнорослий. Грона великі і дуже великі, " +
                    "500-700 г (найкращі до 2 кг), Цилиндроконічні, з лопастями, частіше щільні. " +
                    "Ягоди великі і дуже великі, - 28x23 мм (і більше), 7-15 г, залежно від " +
                    "навантаження куща і агротехніки, яйцевидної (серцеподібної) форми, білі. " +
                    "Цукристість невисока до 15-16 відсотків - що нормально, для врожайних сортів, " +
                    "але при невисокій кислотності 4-6 г/л, смак простий, ненав’язливий, легкий. При " +
                    "повному дозріванні - можливий легкий мускатний аромат.",
                    "http://vinograd.info/sorta/stolovye/arkadiya.html"),
            new GrapesModel("Арочний", R.drawable.arochniy, "Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями. Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями. Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями. Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями. Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями. Арочний - столова " +
                    "гібридна форма винограду, раннього терміну дозрівання 115-120 днів. Кущі " +
                    "сильнорослі. Грона великі 400-600 г, циліндроконічні, помірно-щільні і щільні, " +
                    "добре виконані і вирівняні за масою, без горошіння. Ягоди великі 17-18 x 24-25 " +
                    "мм, овально-сосковидні, рожеві, на сонці червоного кольору, гармонійного смаку, " +
                    "з щільною м’ясистою м’якоттю, іноді насіння досить велике. Шкірвічка з’їдається. " +
                    "Цукристість 16-18 відсотків, кислотність 4-5 г / л. Пагони визрівають дуже добре, " +
                    "практично на всю довжину приросту. Живці вкорінюються добре, вступає в " +
                    "плодоношення на 2-й рік після посадки саджанцями.",
                    "http://vinograd.info/sorta/stolovye/arochnyi.html")};


    // Get-методи для приватних змінних.
    public String getName() {
        return name;
    }

    public int getImageId() {
        return imageId;
    }

    public String getDescription() {
        return description;
    }

    public String getWeb() {
        return web;
    }

    // В якості строкового представлення GrapesModel використовується назва винограду.
    public String toString() {
        return this.name;
    }
}
